app/controllers/addme_controller.rb

INSERT INTO `deals` (`created_at`, `description`, `updated_at`, `user_id`) VALUES ('2012-11-21 06:00:43', 'asd', '2012-11-21 06:00:43', 3)
INSERT INTO `photos` (`created_at`, `deal_id`, `fb_album_id`, `fb_photo_id`, `image`, `name`, `updated_at`) VALUES ('2012-11-24 23:17:27', 5, NULL, '355945351141132', 'open-uri20121124-3739-1bpifqb', 'Yolanda y sus curas', '2012-11-24 23:17:27')
---
  def create
    #oauth = Koala::Facebook::OAuth.new(API_KEYS["facebook"]['app_id'], API_KEYS["facebook"]['app_secret'])
    #oauth.url_for_oauth_code(:permissions => "email,user_location,user_about_me,user_photos")
    graph = Koala::Facebook::GraphAPI.new(current_user.oauth_token)
    #graph = Koala::Facebook::API.new(current_user.oauth_token)

    #feed = graph.get_connections("100001114368363", "photos")
    #feed = graph.get_object("448766258503849")
    #facebook_feed = ActiveSupport::JSON.decode(feed.to_json)
    #puts ">>>>>>>>>>>>>>>"+facebook_feed.inspect
    photos_id = params[:photos_id]

    deal = Deal.new
    deal.description = params[:description]
    deal.user = current_user

    photos_id.each do |p|

      fb_photo = graph.get_object("#{p.split('-')[1]}?fields=id,name,source")

      photo = Photo.new
      photo.fb_photo_id = fb_photo['id']
      photo.fb_album_id = p.split('-')[0]
      photo.name = fb_photo['name']
      photo.remote_image_url = fb_photo['source']

      deal.photos << photo