app/controllers/home_controller.rb

SELECT `deals`.* FROM `deals`
---
  def index

   @oauth = Koala::Facebook::OAuth.new(API_KEYS["facebook"]['app_id'], API_KEYS["facebook"]['app_secret'], {:scope => 'email,user_location,user_about_me,user_photos', :display => 'popup'} )
   #puts "------> "+@oauth.get_app_access_token
   #  @graph_app = Koala::Facebook::API.new(@oauth.get_app_access_token)
  	@deals = Deal.all